In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Shankar", "Niru", "Akshara"],
    "last": ["R", "S", "S"],
    "age": [41, 40, 5]
}

In [3]:
df = pd.DataFrame(people)
df

     first last  age
0  Shankar    R   41
1     Niru    S   40
2  Akshara    S    5

In [4]:
people = {
    "first": ["Shankar", "Niru", "Akshara"],
    "last": ["R", "S", "S"],
    "age": [41, 40, 5],
    "email": ["shan@email.com", "niru@email.com", "aksh@email.com"]
}

In [5]:
df = pd.DataFrame(people)
df

     first last  age           email
0  Shankar    R   41  shan@email.com
1     Niru    S   40  niru@email.com
2  Akshara    S    5  aksh@email.com

In [6]:
df.set_index("email")

                  first last  age
email
shan@email.com  Shankar    R   41
niru@email.com     Niru    S   40
aksh@email.com  Akshara    S    5

In [7]:
df

     first last  age           email
0  Shankar    R   41  shan@email.com
1     Niru    S   40  niru@email.com
2  Akshara    S    5  aksh@email.com

In [8]:
df.set_index("email", inplace=True)
df

                  first last  age
email
shan@email.com  Shankar    R   41
niru@email.com     Niru    S   40
aksh@email.com  Akshara    S    5

In [9]:
df.index

Index(['shan@email.com', 'niru@email.com', 'aksh@email.com'], dtype='object', name='email')

In [17]:
# df.loc["shan@email.com"]
df.set_index("email", inplace=True)

KeyError: "None of ['email'] are in the columns"

In [18]:
df.loc["shan@email.com"]

first    Shankar
last           R
age           41
Name: shan@email.com, dtype: object

In [11]:
df["last"]

email
shan@email.com    R
niru@email.com    S
aksh@email.com    S
Name: last, dtype: object

In [12]:
df.reset_index(inplace=True)
df

            email    first last  age
0  shan@email.com  Shankar    R   41
1  niru@email.com     Niru    S   40
2  aksh@email.com  Akshara    S    5

In [20]:
df.iloc[0]

first    Shankar
last           R
age           41
Name: shan@email.com, dtype: object